Tekla Open API Reference for Tekla Structures 2025
ContainerView.GetAllViews Method
 Gets all the views that are placed on the container view and their children views.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DrawingObjectEnumerator GetAllViews()
Public Function GetAllViews As DrawingObjectEnumerator
Return Value
Type: DrawingObjectEnumerator
The views that are placed on the container view and their children views.
See Also
Reference
ContainerView Class
Tekla.Structures.Drawing Namespace